Revit 2026 API

# AnalyticalStructuralRole Enumeration

---

Indicates the structural role for the analytical elements.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalStructuralRole
```
```vb
Public Enumeration AnalyticalStructuralRole
```
```cpp
public enum class AnalyticalStructuralRole
```
```fsharp
type AnalyticalStructuralRole
```

| Member name | Value | Description |
| --- | --- | --- |
| StructuralRoleBeam | 0 | Member plays role of structural beam. |
| StructuralRoleColumn | 1 | Member plays role of structural column. |
| StructuralRoleFloor | 5 | Member plays role of structural floor. |
| StructuralRoleGirder | 4 | Member plays role of structural girder. |
| StructuralRoleMember | 3 | Member plays role of structural member. |
| StructuralRolePanel | 7 | Member plays role of structural panel. |
| StructuralRoleWall | 6 | Member plays role of structural wall. |
| Unset | -1 | No structural role by default. |

#### Reference

Autodesk.Revit.DB.Structure Namespace